app/views/pessoas/_form.html.erb

SELECT `interesses`.* FROM `interesses`
---
<th colspan="2" style=" font-size: large; color: blue">Interesses</th>
<% Interess.all.in_groups_of(5, false) do |row_interesses| %>

SELECT  1 AS one FROM `interesses` INNER JOIN `interesses_pessoas` ON `interesses`.`id` = `interesses_pessoas`.`interess_id` WHERE `interesses_pessoas`.`pessoa_id` = 1 AND `interesses`.`id` = 1 LIMIT 1
---
<% row_interesses.each do |interesse| %>
<td><%= check_box_tag "pessoa[interess_ids][]", interesse.id, @pessoa.interesses.include?(interesse) %> <%= interesse.descricao %></td>