app/views/home/_sugestao.html.erb

SELECT  `pessoas`.* FROM `pessoas`  WHERE `pessoas`.`user_id` = 1 LIMIT 1
---
<% pessoa = Pessoa.where(:id => current_user.pessoa) %>