app/views/home/tabs.js.erb

$('.tab-content').append('<div id="Inicial" class="tab-pane active"><div class="local">Nas abas a seguir vc encontrará lojas de seu interesses</div></div>');
<% current_user.pessoa.interesses.each do |i|%>
---
SELECT  `pessoas`.* FROM `pessoas`  WHERE `pessoas`.`user_id` = 1 LIMIT 1
SELECT `interesses`.* FROM `interesses` INNER JOIN `interesses_pessoas` ON `interesses`.`id` = `interesses_pessoas`.`interess_id` WHERE `interesses_pessoas`.`pessoa_id` = 1