app/controllers/pessoas_controller.rb

  def index
    @pessoas = Pessoa.all
---
SELECT `pessoas`.* FROM `pessoas`

  def new
    if current_user.pessoa.present?
---
SELECT  `pessoas`.* FROM `pessoas`  WHERE `pessoas`.`user_id` = 1 LIMIT 1

  def create
    @pessoa = Pessoa.new(pessoa_params)
    @pessoa.user_id = current_user.id
    endereco = BuscaEndereco.cep(@pessoa.cep.to_i)
    endereco_montado = "#{endereco[:tipo_logradouro]} #{endereco[:logradouro]}, #{endereco[:bairro]} - #{endereco[:cidade]}"
    @pessoa.endereco = endereco_montado
    respond_to do |format|
      if @pessoa.save
---
INSERT INTO `pessoas` (`created_at`, `endereco`, `idade`, `latitude`, `longitude`, `nome`, `updated_at`, `user_id`) VALUES ('2014-09-20 18:18:05', 'Rua Angelo Vicentim - 1046, SP, Brasil', 28, -22.833739, -47.082384, 'Alexandre Soares', '2014-09-20 18:18:05', 1)

  def update
    respond_to do |format|
      if @pessoa.update(pessoa_params)
---
UPDATE `pessoas` SET `endereco` = 'rua euryclides de jesus zerbini, 115 campinas-sp', `latitude` = -22.8364841, `longitude` = -47.0514995, `updated_at` = '2014-10-01 15:13:50' WHERE `pessoas`.`id` = 5

    def set_pessoa
      @pessoa = Pessoa.find(params[:id])
---
SELECT  "pessoas".* FROM "pessoas"  WHERE "pessoas"."id" = ? LIMIT 1  [["id", 1]]