app/controllers/places_controller.rb

INSERT INTO `places` (`created_at`, `nome`, `nota`, `pessoa_id`, `updated_at`) VALUES ('2014-10-08 22:37:36', 'Picanha de Ouro', 10.0, 1, '2014-10-08 22:37:36')
---
  def new_place
  @place = Place.new
  @place.nome = params[:nome]
  @place.pessoa_id = params[:pessoa]
  @place.nota = params[:nota]
  respond_to do |format|
    if @place.save