app/views/layouts/_navigation_links.html.erb

      <ul class="dropdown-menu" role="menu" aria-labelledby="dropdownMenu1">
	<% if current_user.pessoa.present? %>
---
SELECT  `pessoas`.* FROM `pessoas`  WHERE `pessoas`.`user_id` = 1 LIMIT 1